In [1]:
import pandas as pd
data_html = pd.read_html("https://en.wikipedia.org/wiki/Money_Heist")[1]

In [2]:
data_html.head()

  Part[a] Season[a] Episodes            Originally released                    \
  Part[a] Season[a] Episodes Episodes.1      First released     Last released
0       1      1[e]       13         13          2 May 2017      27 June 2017
1       2      1[e]        9          9     16 October 2017  23 November 2017
2       3         2        8          8        19 July 2019      19 July 2019
3       4         2        8          8        3 April 2020      3 April 2020
4       5         3       10          5    3 September 2021  3 September 2021


    Network
0  Antena 3
1  Antena 3
2   Netflix
3   Netflix
4   Netflix

In [1]:
import sqlite3
conn = sqlite3.connect('testdb.sqlite')
cursor = conn.cursor()
print("Opened database successfully")

Opened database successfully

In [2]:
cursor.execute('''CREATE TABLE SCHOOL
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         MARKS          INT);''')
cursor.close()

In [3]:
cursor = conn.cursor()
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (1, 'Rohan', 14, 'Delhi', 200)");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (2, 'Allen', 14, 'Bangalore', 150 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (3, 'Martha', 15, 'Hyderabad', 200 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (4, 'Palak', 15, 'Kolkata', 650)");
conn.commit()

In [4]:
cursor = conn.cursor()

for row in cursor.execute("SELECT id, name, marks from SCHOOL"):

    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("MARKS = ", row[2], "\n")

conn.commit()
# conn.close()

ID =  1
NAME =  Rohan
MARKS =  200

ID =  2
NAME =  Allen
MARKS =  150

ID =  3
NAME =  Martha
MARKS =  200

ID =  4
NAME =  Palak
MARKS =  650